In [1]:
import numpy as np
import pandas as pd

In [2]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [6]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [7]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [ ]:
pd.merge(employees,salaries) # Default it uses common key which is employee_id

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [ ]:
pd.merge(employees,salaries,on="employee_id",how="inner") # This is default 
#inner mean merge and show on the base of 1,2,3 ids means inner data

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [ ]:
pd.merge(employees,salaries,on="employee_id",how="outer")
# Outer mean full data show even the ids are not available for match
#Actually it uses coulmn or attribues names for merging which is same because
#both have employee_id column and we get Nan where id 
#Here you can see Name and department are missing salaries coloumn
# and salary and bonus are missing in employee columns so we get Nan there
#for filling
#And Nan are dangerous

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [ ]:
pd.merge(employees,salaries,on="employee_id",how="left")
#here we get all the values of colums from the employee table and
# get NaN in salary and bonus table because we will all the data for left table and if there is salary and bonus values are missing 
# then we get Nan there

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [14]:
pd.merge(employees,salaries,on="employee_id",how="right")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

<h3>Concatinate The dataframe</h3>

In [22]:
pd.concat((employees,salaries))

   employee_id   name department   salary    bonus
0            1   John         HR      NaN      NaN
1            2   Anna         IT      NaN      NaN
2            3  Peter    Finance      NaN      NaN
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
0            1    NaN        NaN  60000.0   5000.0
1            2    NaN        NaN  80000.0  10000.0
2            3    NaN        NaN  65000.0   7000.0
3            6    NaN        NaN  70000.0   8000.0
4            7    NaN        NaN  90000.0  12000.0

In [ ]:
pd.concat((salaries,employees),axis=1)
# axis 1 mean the columns of data table 1 and table 2 will be merged

   employee_id  salary  bonus  employee_id   name department
0            1   60000   5000            1   John         HR
1            2   80000  10000            2   Anna         IT
2            3   65000   7000            3  Peter    Finance
3            6   70000   8000            4  Linda         IT
4            7   90000  12000            5    Bob         HR

<h3>Joining The Data Frame</h3>

In [23]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [24]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [43]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
},index=[1,2,3])

df2 = pd.DataFrame({
    'B': ['A3', 'A4', 'A5'],
},index=[1,2,3])

In [44]:
df1

    A
1  A0
2  A1
3  A2

In [45]:
df2

    B
1  A3
2  A4
3  A5

In [46]:
df1.join(df2)

    A   B
1  A0  A3
2  A1  A4
3  A2  A5

The End